Revit 2027 API
FabricSheetType.MajorLayoutPattern Property
 The layout pattern in the major direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricSheetLayoutPattern MajorLayoutPattern { get; }
Public ReadOnly Property MajorLayoutPattern As FabricSheetLayoutPattern
	Get
public:
property FabricSheetLayoutPattern MajorLayoutPattern {
	FabricSheetLayoutPattern get ();
}
member MajorLayoutPattern : FabricSheetLayoutPattern with get
Property Value
FabricSheetLayoutPattern
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace